{"TemplateURL": "https://raw.githubusercontent.com/binhex/docker-templates/master/binhex/airsonic.xml", "Name": "binhex-airsonic", "Overview": "Airsonic is a free, web-based media streamer, providing ubiquitious access to your music. Use it to share your music with friends, or to listen to your own music while at work. You can stream to multiple players simultaneously, for instance to one player in your kitchen and another in your living room.[br]\n    Airsonic is designed to handle very large music collections (hundreds of gigabytes). Although optimized for MP3 streaming, it works for any audio or video format that can stream over HTTP, for instance AAC and OGG. By using transcoder plug-ins, Airsonic supports on-the-fly conversion and streaming of virtually any audio format, including WMA, FLAC, APE, Musepack, WavPck and Shorten.[br]\n    If you have constrained bandwidth, you may set an upper limit for the bitrate of the music streams. Airsonic will then automatically resample the music to a suitable bitrate.[br]\n    In addition to being a streaming media server, Airsonic works very well as a local jukebox. The intuitive web interface, as well as search and index facilities, are optimized for efficient browsing through large media libraries. Airsonic also comes with an integrated Podcast receiver, with many of the same features as you find in iTunes.[br]\n    Based on Java technology, Airsonic runs on most platforms, including Windows, Mac, Linux and Unix variants.[br][br]", "ReadMe": "https://github.com/binhex/documentation", "Registry": "https://registry.hub.docker.com/r/binhex/arch-airsonic/", "GitHub": "https://github.com/binhex/arch-airsonic", "Repository": "binhex/arch-airsonic", "Project": "https://github.com/airsonic/airsonic", "BindTime": "true", "Privileged": "false", "Networking": {"Mode": "bridge", "Publish": {"Port": {"HostPort": "4040", "ContainerPort": "4040", "Protocol": "tcp"}}}, "Environment": {"Variable": [{"Name": "CONTEXT_PATH", "Value": "/"}, {"Name": "MAX_MEMORY", "Value": "2046"}, {"Name": "UMASK", "Value": "000"}, {"Name": "PUID", "Value": "99"}, {"Name": "PGID", "Value": "100"}]}, "Data": {"Volume": [{"HostDir": "/mnt/user/appdata/config", "ContainerDir": "/config", "Mode": "rw"}, {"HostDir": "/mnt/user", "ContainerDir": "/media", "Mode": "rw"}]}, "WebUI": "http://[IP]:[PORT:4040]/", "Icon": "https://raw.githubusercontent.com/binhex/docker-templates/master/binhex/images/airsonic-icon.png", "Repo": "Binhex's Repository", "CategoryList": ["MediaServer-Music"], "topTrending": -0.29600000000000004, "topPerforming": 1.196}